[
  {
    "title": "Mid. Full-stack Engineer (React Native/ ReactJS)",
    "company": "Silentium Vietnam",
    "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBN2xQUGc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--63d05dc321c04c5929998ce24128e76e667ab2b5/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJY0c1bkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--c8c20c63b868249effdba9ba4f05aa0c5b77cab3/Silentium_Web_Illusatrtion-03.png",
    "url": "https://itviec.com//it-jobs/mid-full-stack-engineer-react-native-reactjs-silentium-vietnam-4433?lab_feature=preview_jd_page",
    "location": "Ho Chi Minh",
    "mode": "Hybrid",
    "descriptions": "- Develop and maintain applications usingNode.js, ReactJS, and React Native\n- You’ll take extreme ownership of your work. Every day is a challenge to ensure you perform to the level you and your product team agreed on upfront\n- Work closely with the Product Manager, Product Designer, and other developers to deliver the product\n- Architect and develop excellent React Native Applications while maintaining high-quality code\n- Write unit and integration tests for Mobile\n- Work with Native Module as needed\n- Release applications to Google Play and Apple Store\n- Taking care of the Continuous Delivery pipeline for Mobile to guarantee the continuity of the delivery",
    "requirements": "- 4 years of professional React-native development experience\n- At least 4 years of professional development experience, proficient in the JavaScript and TypeScript ecosystem.\n- Experience with writing Unit tests, integration tests, and end-to-end tests using frameworks like (Jest, AVA, Cypress, Playwright, etc)\n- Experience working with Swift, Objective-C, or Java (on Android) would be a plus\n- Experience working with handling Cryptography, handling sensitive data on the App would be a plus\n- Very self-motivated, proactive working style. We move as a team where each team member reaches out for problem to solve, not the other way around\n- A critical thinking and product mindset.\n- Professional and be a TEAM PLAYER,because we can move nowhere without a team.\n- Keep yourself updated, mobile development is moving too fast for us to stay still",
    "suitability": 0
  },
  {
    "title": "Remote Solutions Developer (ReactJS, NodeJS)",
    "company": "Otto International",
    "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBN2Y4Snc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--f15a61498686a33ce391841d9b358a0d14aa1e43/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJY0c1bkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--c8c20c63b868249effdba9ba4f05aa0c5b77cab3/logo_colour.png",
    "url": "https://itviec.com//it-jobs/remote-solutions-developer-reactjs-nodejs-otto-international-5014?lab_feature=preview_jd_page",
    "location": "Ho Chi Minh",
    "mode": "Remote",
    "descriptions": "- Collaborate with stakeholders to understand business requirements and translate them into technical specifications and solution designs.\n- Write clean, efficient, and maintainable code to develop software solutions that meet business objectives. This includes designing, coding, testing, and debugging applications using relevant programming languages and frameworks.\n- Integrate software solutions with existing systems, databases, and third-party applications, ensuring seamless data flow and interoperability.\n- Monitor, maintain and enhance existing software applications to ensure optimal performance, scalability, and reliability.\n- Identify and resolve technical issues, bugs and bottlenecks in a timely manner. Proactively suggest improvements and implement solutions to optimize software performance.\n- Work closely with cross-functional teams to ensure effective collaboration and successful project delivery.\n- Stay updated with the latest trends and advancements in software development and propose innovative solutions to improve business processes and outcomes.- As a Solutions Developer at Otto International, you will play a crucial role in designing, developing and implementing software solutions to meet the business needs of our organization. You will collaborate with cross-functional teams to analyse requirements, create technical specifications, and build robust and scalable software applications. Your expertise will contribute to the success of our company’s technology initiatives and help drive innovation.\n- \n- How will you make a difference?",
    "requirements": "- Bachelor’s degree in Computer Science, Software Engineering or equivalent.\n- Proven experience (ideally 2-5 years) as a software developer, software engineer, solutions developer or a similar role with a strong track record of successful software delivery.\n- Strong knowledge of React, JavaScript, NodeJS, HTML5, MySQL, MongoDB, GraphQL, Bootstrap, Amazon Cloud Services.\n- Additional experience with PHP, React Native, PostgreSQL, WordPress customisation is a plus.\n- Solid understanding of software development methodologies, tools and best practices.\n- Strong problem solving abilities, with a logical and analytical mindset to identify and resolve software issues efficiently.\n- Ability to analyse complex business requirements and translate them into technical solutions.\n- Strong verbal and written communication skills\n- Strong teamwork and interpersonal skills- Who we are looking for?",
    "suitability": 50
  },
  {
    "title": "Frontend Engineer (ReactJS) - Weverse Product",
    "company": "NAVER VIETNAM",
    "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBODF1SkE9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--da4ae1908c127c677e6c706e25596035b231b592/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJY0c1bkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--c8c20c63b868249effdba9ba4f05aa0c5b77cab3/Naver_Logo(2)-white.png",
    "url": "https://itviec.com//it-jobs/frontend-engineer-reactjs-weverse-product-naver-vietnam-5338?lab_feature=preview_jd_page",
    "location": "Ho Chi Minh",
    "mode": "Hybrid",
    "descriptions": "- Developing Weverse services\n- Design and implement Frontend services\n- Implement CI/CD and Monitoring\n- Co-working with Vietnam and Korea teams- Your daily task:",
    "requirements": "- 5+ years of experience in Vanilla Javascript, HTML, and CSS\n- 3+ years of experience in ReactJS\n- Solid computer science fundamentals: theory, data structures, algorithms, design patterns\n- Write maintainable code, clean code\n- Excellent understanding of the JavaScript language and ecosystem including front-end build tools (Webpack, Babel)\n- Excellent analytical thinking and good problem-solving skills\n- Hands-on experience with Client-side rendering, Server-side rendering\n- Hands-on experience with Unit Test\n- Open-minded, honest and have a positive attitude towards people\n- Good at communication skills in general and English skills in particular\n- Hands-on experience with E2E Testing\n- Understanding work mechanism and underlying architecture of each frontend modern library/framework\n- Hands-on experience with design frontend architecture from scratch or apply Architecture Pattern- Your background:\n- It's a big plus if you:\n- *Due to the volume of interest and applications we receive, our response time may be slower than usual. We appreciate your patience and understanding as we carefully review each application.",
    "suitability": 0
  },
  {
    "title": "FrontEnd Developer (JavaScript, React Native, ReactJS)",
    "company": "ABBANK",
    "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBOExhSWc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--d257e70c6585afdab6d5516fdec5419a75319c18/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJY0c1bkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--c8c20c63b868249effdba9ba4f05aa0c5b77cab3/logo.png",
    "url": "https://itviec.com//it-jobs/frontend-developer-abbank-0518?lab_feature=preview_jd_page",
    "location": "Ha Noi",
    "mode": "At office",
    "descriptions": "- Lập trình, phát triển các hệ thống, ứng dụng của Ngân hàng.\n- Tự phát triển hoặc phối hợp cùng các nhà cung cấp phát triển/ triển khai các giải pháp CNTT.\n- Phát triển các ứng dụng Android/iOS hướng tới số lượng lớn các thiết bị Android/iOS đa dạng.\n- Thiết kế, phát triển và tối ưu hóa hiệu suất của các sản phẩm Ứng dụng di động.\n- Hỗ trợ trong quá trình kiểm thử (UAT, Performance test, Pen test), thực hiện sửa lỗi (nếu phát sinh).\n- Phân tích và xử lý sự cố theo phân công. Đánh giá rủi ro của các phần mềm quan trọng, đề xuất bổ sung các biện pháp kiểm soát để giảm thiểu rủi ro.\n- Viết tài liệu kỹ thuật, đóng góp xây dựng lộ trình, kế hoạch phát triển và cải tiến các giải pháp phần mềm.",
    "requirements": "- Ít nhất 05 năm kinh nghiệm ở vị trí Phát triển FrontEnd.\n- Tốt nghiệp Đại học trở lên chuyên ngành về Khoa học máy tính, Công nghệ thông tin, Toán Tin hoặc các chuyên ngành liên quan.\n- Thành thạo về React Native, ReactJS, Flutter,CSS, HTML, JavaScript, Responsive Design, …\n- Có kinh nghiệm lập trình Mobile trên nền tảng Androi/iOS (Swift, Objective-C, Kotlin, Jetpack,…)\n- Có kinh nghiệm về PL/SQL, thành thạo việc thiết kế CSDL trên DB Oracle, MS SQL, PostgreSQL, NoSQL, and MongoDB …\n- Kinh nghiệm xây dựng các ứng dụng trên nền tảng cloud.\n- Kinh nghiệm với các công nghệ sau: Git, CI/CD, K8s, Docker, Linux.\n- Có kiến thức về quy trình triển khai và phát triển phần mềm Waterfall/Agile.\n- Có khả năng nghiên cứu công nghệ mới, học tập nhanh.",
    "suitability": 20
  },
  {
    "title": "Frontend Engineer (ReactJS, VueJS)",
    "company": "LINE Technology Vietnam",
    "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBMUs5REE9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--5cac20e17063994bfc8c3c46b237953da1f8f929/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJY0c1bkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--c8c20c63b868249effdba9ba4f05aa0c5b77cab3/line-viet-nam-logo.png",
    "url": "https://itviec.com//it-jobs/frontend-engineer-javascript-html-reactjs-line-technology-vietnam-3036?lab_feature=preview_jd_page",
    "location": "Ha Noi",
    "mode": "Hybrid",
    "descriptions": "- We are looking for a qualified, creative, energetic and self-starting Front-end Developer with wide experience in developing and optimizing web application.\n- • Participate product/application development life cycle, including planning, analysis, design, implementation and maintenance, focus on UX/UI design both for PC and mobile.\n- • Create user-friendly web application with modern technologies (JavaScript/ HTML5/ CSS3) and framework (VueJS/ ReactJS)\n- • Proposing and designing UI with consideration of UX.\n- • Build reusable code and libraries for future use.\n- • Keep yourself up-to-date with emerging technologies.\n- • Write technical specifications based on conceptual design, business/technical requirements.\n- • Collaborate with Back-end Engineer and others to improve usability.",
    "requirements": "- Must to have\n- • More than 2 years of work experience in Front-end development.\n- • Excellence knowledge of HTML/CSS/DOM/JavaScript.\n- • Good knowledge of browser troubleshooting and debugging.\n- • Ability to build a web application with at least one of JS frameworks like ReactJS/ VueJS from the beginning.\n- • Have passion for exploring and learning new technology\n- • High sense of responsibility\n- Nice to have\n- • English from intermediate to advanced.\n- • Experience in using React Native.\n- • Experience in using cloud services such as AWS, Azure, etc.\n- • Experience in using tools for build and task runners (CI/CD).\n- • Experience in developing applications with server-side languages such as Java, NodeJS, Go, Perl, php, ruby, .net, python…\n- • Preferred knowledge of web performance technology.\n- • Experience with Agile/Scrum development.\n- • Contribution to OSS projects and communities.",
    "suitability": 20
  },
  {
    "title": "Fullstack Developer (NodeJS, ReactJS)",
    "company": "Sunbytes",
    "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBemRuTWc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--89d7be887704f373884b842c4e98a4e3d2ab9e8a/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJYW5CbkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--e064c7b4667a202bc74d582f9581c9a645d77ae5/Sunbytes%20Square%20Logo.jpg",
    "url": "https://itviec.com//it-jobs/fullstack-developer-nodejs-reactjs-sunbytes-4238?lab_feature=preview_jd_page",
    "location": "Ho Chi Minh",
    "mode": "At office",
    "descriptions": "- About Sunbytes\n- Sunbytes is a leading technology consulting firm that delivers innovative and scalable software solutions. We have a strong reputation in the industry for delivering high-quality products and are committed to providing a supportive and challenging work environment for our members. Our team is composed of talented and experienced software engineers, project managers, and business consultants from around the world.\n- At Sunbytes, we believe in providing opportunities for growth and career development, and we are always looking for talented individuals to join our team. Our client-focused approach and commitment to delivering the best possible solutions for our clients make Sunbytes an exciting place to work, and a great opportunity for Developers looking for a challenging and rewarding role.\n- \n- About the Role:\n- Sunbytes is looking for a full-timeFullstack NodeJS Developerwith at least 3+ years of experience. Our client comprises talented developers in Viet Nam, working with the Netherlands team to deliver innovative software solutions for one of the largest Health Platforms used in The Netherlands\n- \n- As aFullstack NodeJS Developer,you are expected to have a strong background and a solid understanding of fullstack development principles to support a team of developers in building high-quality web applications in the Healthcare domain.",
    "requirements": "- Bachelor's degree in Computer Science or a related field.\n- 5+ years of experience in TypeScript development.\n- Experience with Node.js (Nestjs), Next.js, and React.\n- Strong independent work ethic and ability to work autonomously on tasks.\n- Excellent English language skills, both written and verbal.\n- Strong problem-solving skills and ability to take initiative independently.\n- Enthusiasm for innovation and continuous skill development.\n- MongoDB\n- gRPC\n- Next.JS\n- Remix.JS\n- BIT\n- GraphQL\n- Experience with microservice architecture- Must have skills:\n- Nice to have skills:",
    "suitability": 20
  },
  {
    "title": "Front End Developer (ReactJS, Good English)",
    "company": "Outcubator",
    "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBMjhWSFE9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--4d14fc25fcf82a34f870d5e655272ff42af00178/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJY0c1bkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--c8c20c63b868249effdba9ba4f05aa0c5b77cab3/outcubator.png",
    "url": "https://itviec.com//it-jobs/front-end-developer-reactjs-good-english-outcubator-4304?lab_feature=preview_jd_page",
    "location": "Ha Noi",
    "mode": "At office",
    "descriptions": "- Develop user-facing features with a focus on responsive and intuitive design.\n- Build efficient and reusable front-end systems to drive our web applications.\n- Collaborate with backend developers and UI/UX designers to improve user experiences.\n- Translate designs and wireframes into high-quality code.\n- Optimize applications for maximum speed and scalability.\n- Collaborate with other team members and stakeholders.\n- Participate in code reviews and contribute to team and personal learning.\n- Undertake additional tasks as required to support project goals.- Outcubatoris global fintech product company, headquartered in San Francisco, focused on building payment and E-commerce solution that make an impact. We have spanned operations across 20+ offices around the world.\n- The founders are American and European and have chosen Hanoi as a home base where all the software development take place.\n- \n- We arelooking forFront-end Developerwho wants to level-up their career in the payment industry. If coding is your ambition, and you are ready for real challenges of this technology era so come and join our Hanoi office to be our Front-end Developer. We always welcome your talent, and we offer you great benefits as you dedicate for us.\n- \n- Responsibilities:",
    "requirements": "- Bachelor’s degree in Computer Science, Engineering, or a related field.\n- Proven experience as a React Developer with a strong portfolio of projects.\n- In-depth experience in building complex applications using React.\n- Proficiency in TypeScript.\n- Advanced understanding of web markup, including HTML5 and CSS3, with a strong emphasis on perfect pixel and responsive design principles.\n- Expertise in client-side scripting and JavaScript frameworks, with a strong emphasis on ReactJS.\n- Deep knowledge of cross-browser compatibility issues and effective solutions within React environments.\n- Proficiency in state management solutions, especially Redux, or similar libraries/frameworks, to manage application state in React projects.\n- Proficient use of code versioning tools, such as Git.\n- Familiarity with consuming RESTful APIs and implementing modern authorization mechanisms like JSON Web Tokens within React applications.\n- Understanding of CSS pre-processing platforms such as LESS and SASS.\n- Experience with modern front-end build pipelines and tools, such as Webpack, Vite, Rollup, used in React development.\n- Experience in packaging SDKs and creating shareable packages/modules for efficient distribution and reuse across projects.\n- Knowledge of SEO principles and their application in React projects.\n- Additional experience with server-side technologies like Node.js is highly beneficial.",
    "suitability": 70
  },
  {
    "title": "Frontend Developer (ReactJS, JavaScript)",
    "company": "Vietnam International Bank (VIB)",
    "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBOTRxREE9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--5457414b10dacd1686f3edd8f39dbade695f9ec3/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJY0c1bkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--c8c20c63b868249effdba9ba4f05aa0c5b77cab3/vietnam-international-bank-vib-logo.png",
    "url": "https://itviec.com//it-jobs/frontend-developer-reactjs-javascript-vietnam-international-bank-vib-3945?lab_feature=preview_jd_page",
    "location": "Ho Chi Minh",
    "mode": "At office",
    "descriptions": "- Chịu trách nhiệm (i) Phát triển, nâng cấp và tích hợp các ứng dụng công nghệ số, ii) Vận hành, bảo trì các ứng dụng; (iii) Tìm hiểu, nghiên cứu các xu hướng, công cụ mới để đưa ra các tư vấn, giải pháp phù hợp.\n- Trách nhiệm:\n- Phát triển, nâng cấp và tích hợp các ứng dụng công nghệ số; Tìm hiểu các công nghệ mới, các giải pháp để đề xuất, tư vấn áp dụng tại VIB;\n- Vận hành, bảo trì các ứng dụng, đảm bảo các ứng dụng hoạt động ổn định;\n- Tìm hiểu, nghiên cứu các xu hướng, công cụ mới để đưa ra các tư vấn, giải pháp phù hợp;\n- Tham gia xây dựng tài liệu kỹ thuật cho dự án, giải pháp;\n- Thực hiện các nhiệm vụ khác theo phân công của cấp quản lý.",
    "requirements": "- Tốt nghiệp Đại học trở lên chuyên ngành Công nghệ thông tin, Khoa học máy tính, Phát triển phần mềm hoặc các chuyên ngành liên quan và/hoặc có kinh nghiệm làm việc ở các vị trí tương đương tại các tổ chức uy tín trong và ngoài nước;\n- Tối thiểu 7 năm (Chuyên gia)/5 năm (Chuyên viên cao cấp)/3 năm (Chuyên viên chính)/1 năm (Chuyên viên) kinh nghiệm làm việc trong lĩnh vực phát triển ứng dụng, tích hợp hệ thống;\n- Kinh nghiệm xây dựng hệ thống micro-services có lượng giao dịch lớn;\n- Kinh nghiệm xây dựng các tính năng front-end sử dụngJavascriptvàReactJScho hệ thống có lượng giao dịch lớn;\n- Kinh nghiệm xây dựng các ứng dụng trên nền tảng cloud (AWS/GCP);\n- Kinh nghiệm sử dụng với Mysql, Redis, Memcached, NoSQL;\n- Kinh nghiệm sử dụng React stack (ReactJS, Redux, State Management, Functional Programming, Immutability);\n- Kinh nghiệm với các công nghệ sau: Kafka, Ansible/Puppet, Git, CI/CD, K8s, Docker, Linux;\n- Am hiểu Restful API, Oauth, SSO;\n- Am hiểu các công nghệ front-end dựa được xây dựng dựa trên JavaScript, HTML, CSS;\n- Am hiểu Javascript ES5 & ES6+;\n- Am hiểu một ngôn ngữ lập trình backend: Java/Go;\n- Kỹ năng tiếng Anh thành thạo.",
    "suitability": 10
  },
  {
    "title": "Fullstack Developer (ReactJS, NodeJS)",
    "company": "CÔNG TY TNHH LEFIN",
    "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBOHZJVEE9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--1e1707d2ec149a2064b436aa6b13adc6cbf860cb/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJY0c1bkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--c8c20c63b868249effdba9ba4f05aa0c5b77cab3/Screen%20Shot%202024-07-03%20at%2013.48.46.png",
    "url": "https://itviec.com//it-jobs/fullstack-developer-reactjs-nodejs-cong-ty-tnhh-lefin-5614?lab_feature=preview_jd_page",
    "location": "Ha Noi",
    "mode": "At office",
    "descriptions": "- Yêu cầu công việc sẽ trao đổi chi tiết trong quá trình phỏng vấn.",
    "requirements": "- 2 năm kinh nghiệm vị trí Fullstack Developer\n- Có kỹ năng đọc hiểu tài liệu tốt\n- Thanh thạo HTML/CSS/Javascript\n- Thành thạo React, có kinh nghiệm Nextjs (SSR-CSR). Redux-toolkit / saga\n- Thành thạo Nestjs framework(Typeorm)\n- Có kinh nghiệm Microservices (lợi thế)\n- Có kinh nghiệm về web3 (lợi thế)\n- Biết sử dụng Docker (lợi thế)",
    "suitability": 20
  },
  {
    "title": "Middle Web Developer (Python, ReactJS, JavaScript)",
    "company": "GKIM DIGITAL",
    "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBM3JxSkE9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--6452a4ff00bfbb22c1d243f2f8796baec7ca93e4/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJYW5CbkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--e064c7b4667a202bc74d582f9581c9a645d77ae5/z3174298233781_fb24c082dae06bed24ab9ca86655031f.jpg",
    "url": "https://itviec.com//it-jobs/middle-web-developer-python-reactjs-javascript-gkim-digital-0412?lab_feature=preview_jd_page",
    "location": "Ho Chi Minh",
    "mode": "At office",
    "descriptions": "- Collaborate closely with designers and fellow developers to bring web applications to life.\n- On the front end: Design and implement the data structure and presentation layer using ReactJS. Manage application state effectively with libraries like React, React Hooks, Context, and Redux. Make asynchronous API calls and handle data fetching.\n- Ensure cross-browser compatibility: Test and refine the web application for optimal performance across various browsers.\n- Design and implement database structures that seamlessly align with application needs.\n- Leverage Python expertise: Write clean, scalable, testable, and efficient Python code. Use additional Python libraries such as Django Rest Framework to build robust APIs for the front end.- We are looking for a Python and React.JS Developer responsible for designing and developing hands-on software. You will work in a team with other software engineers to design, implement, and deploy software that meets the customer’s requirements. The code must scale easily, be reusable, testable, and efficient.\n- \n- Responsibilities:",
    "requirements": "- 2+ years of experience building web applications with modern JavaScript (including HTML and CSS).\n- Strong grasp of ReactJS: In-depth knowledge of rendering data to the DOM and managing application state with libraries like React Hooks, Redux, or React Router.\n- 2+ years of experience in back-end development using Python.\n- Solid understanding of database schema design principles.\n- Experience optimizing and profiling Python code for efficiency.\n- Proficiency with RESTful API libraries: Familiarity with Django, Django Rest Framework, or Flask is a plus.\n- Experience with Git for version control.\n- Good written and verbal English communication skills.\n- Interest in expanding your knowledge of APIs, databases, and mobile app design.\n- Familiarity with cloud service providers like AWS, GCP, or Azure.\n- The ability to work independently and manage your time effectively.\n- A willingness to learn new technologies and adapt to evolving methodologies.\n- A collaborative spirit and a desire to support team members (flexible schedule is a plus, but night shifts are not required).- Required Skills:\n- Bonus points if have:",
    "suitability": 20
  },
  {
    "title": "Web Developer (VueJS, ReactJS)",
    "company": "Victoria Saigon South School",
    "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBMTluVEE9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--8399fd25b8513fff9d6105dd1720f4844b5007ac/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJY0c1bkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--c8c20c63b868249effdba9ba4f05aa0c5b77cab3/images.png",
    "url": "https://itviec.com//it-jobs/web-developer-vuejs-reactjs-victoria-saigon-south-school-2034?lab_feature=preview_jd_page",
    "location": "Ho Chi Minh",
    "mode": "At office",
    "descriptions": "- Công việc chính:\n- Chúng tôi đang tìm kiếm một Web Developer có kỹ năng để tạo template CMS bằng HubSpot. Ứng viên lý tưởng sẽ có hiểu biết vững chắc về phát triển dựa trên module và kinh nghiệm làm việc với các dự án sử dụng Vue hoặc React. Kiến thức về API và các phương thức xác thực là rất cần thiết. Kinh nghiệm về Python là một điểm cộng.\n- Trách nhiệm chính:\n- · Phát triển và tùy chỉnh template CMS bằng module của Hubspot.\n- · Triển khai các giải pháp front-end sử dụng các framework Vue hoặc React.\n- · Tích hợp các API của bên thứ ba và đảm bảo trao đổi dữ liệu mượt mà giữa các hệ thống.\n- · Thực hiện và quản lý các phương thức xác thực khác nhau.\n- · Hợp tác với đội ngũ thiết kế để đảm bảo trải nghiệm người dùng liền mạch.\n- · Tối ưu hóa ứng dụng để đạt tốc độ và khả năng mở rộng tối đa.\n- · Khắc phục sự cố và gỡ lỗi ứng dụng khi cần.\n- · Cập nhật các xu hướng và công nghệ mới trong lĩnh vực phát triển web.",
    "requirements": "- Yêu cầu:\n- · Tối thiểu 2 năm kinh nghiệm trong lĩnh vực phát triển web.\n- · Thành thạo phát triển các mẫu CMS của HubSpot.\n- · Kiến thức vững về các framework Vue hoặc React.\n- · Kiến thức vững về HTML, SCSS, javascript\n- · Kinh nghiệm với phát triển dựa trên module.\n- · Hiểu biết về API và các phương thức xác thực.\n- · Kiến thức cơ bản về Python là một điểm cộng.\n- · Kỹ năng giải quyết vấn đề và chú ý đến chi tiết.\n- · Kỹ năng giao tiếp và làm việc nhóm tốt.\n- · Khả năng quản lý nhiều task và hoàn thành đúng thời hạn.\n- Yêu cầu ưu tiên:\n- · Kinh nghiệm với các nền tảng CMS khác.\n- · Hiểu biết về phát triển back-end.\n- · Kinh nghiệm với các hệ thống quản lý phiên bản như Git.",
    "suitability": 75
  }
]