[
    {
        "title": "Nhân Viên Xử Lý Dữ Liệu (Dữ Liệu Về Hiệu Suất Hoạt Động, Chỉ Tiêu, Không Phải Vị Trí Data Analyst)",
        "company": "CÔNG TY CỔ PHẦN CÔNG NGHỆ HỢP LONG",
        "logo": "https://cdn-new.topcv.vn/unsafe/150x/https://static.topcv.vn/company_logos/Q5vc3HxXx3dmIE7sENmAg1y6Nourj8yb_1647318941____03598960d0a2461cffb745d79695bc0e.png",
        "url": "https://www.topcv.vn/viec-lam/nhan-vien-xu-ly-du-lieu-du-lieu-ve-hieu-suat-hoat-dong-chi-tieu-khong-phai-vi-tri-data-analyst/1381941.html?ta_source=JobSearchList_LinkDetail&u_sr_id=PIkV5ZX8AHlKaGbbaZna75jtjAa7bQd3NSbCzvYw_1719855979",
        "location": "Hà Nội",
        "salary": "7 - 10 triệu",
        "status": "Cập nhật 6 ngày trước",
        "descriptions": [
            "• Tiến hành xuất số liệu từ phần mềm nội bộ và tổng hợp các số liệu về doanh số, số lượng khách hàng, đơn hàng,... (thực hiện định kỳ và phát sinh theo yêu cầu của Quản lý)• Tính toán, theo dõi tiến độ đạt KPI và các hiệu suất kinh doanh khác theo số liệu có sẵn từ phần mềm nội bộ• Báo cáo và update cho Quản lý, các Bộ phận liên quan (được chỉ định) các số liệu kinh doanh (như nêu trên)• Thực hiện các công việc khác linh hoạt theo sự phân công và hướng dẫn của Quản lý"
        ],
        "requirements": [
            "• Giới tính: Nữ• Cẩn thận, tỷ mỉ, cầu toàn• Trung thực, nhanh nhẹn, có tinh thần trách nhiệm cao, tôn trọng đạo đức nghề nghiệp và đảm bảo nguyên tắc bảo mật thông tin.• Sử dụng tốt tin học văn phòng (Xử lý dữ liệu bằng Microsoft)"
        ],
        "suitability": 80
    },
    {
        "title": "Nhân Viên Phân Tích Dữ Liệu - Data Analyst (App)",
        "company": "Công Ty Cổ Phần Công Nghệ Android Việt Nam",
        "logo": "https://cdn-new.topcv.vn/unsafe/150x/https://static.topcv.vn/company_logos/cong-ty-co-phan-cong-nghe-android-viet-nam-5e74a2070e74b.jpg",
        "url": "https://www.topcv.vn/viec-lam/nhan-vien-phan-tich-du-lieu-data-analyst-app/1146727.html?ta_source=JobSearchList_LinkDetail&u_sr_id=PIkV5ZX8AHlKaGbbaZna75jtjAa7bQd3NSbCzvYw_1719855979",
        "location": "Hà Nội",
        "salary": "Tới 20 triệu",
        "status": "Cập nhật 1 ngày trước",
        "descriptions": [
            "Tổng hợp dữ liệu người dùng từ các nguồn Google Analytic/Firebase và Adjust",
            "Theo dõi, phân tích, đánh giá các chỉ số để đưa ra các phương án đề xuất cho Product Team, Marketing Team",
            "Phân tích dữ liệu các sản phẩm của công ty (key metrics)",
            "Tạo mô hình dự đoán LTV các sản phẩm của công ty;",
            "Đánh giá mức độ hiệu quả của các chiến dịch UA marketing cho app iOS/Android;",
            "Thu thập dữ liệu, trực quan hóa dữ liệu để xây dựng các báo cáo phân tích;",
            "Tiến hành các thử nghiệm A/B test và phân tích kết quả của chúng;",
            "Nghiên cứu, đưa ra những ý tưởng phân tích dữ liệu để hiểu sâu và có các góc nhìn mới hơn từ các dữ liệu."
        ],
        "requirements": [
            "Tốt nghiệp đại học chuyên ngành toán, kinh tế, khoa học máy tính, quản lý thông tin, thống kê...",
            "Đã có kinh nghiệm (tối thiểu 6 tháng) tại vị trí tương đương hoặc có hiểu biết về ngành công nghiệp App Mobile;",
            "Có kinh nghiệm làm việc với Google Analytic/ Firebase cũng như các nguồn tracking khác liên quan.",
            "Có hiểu biết về marketing và các chỉ số app (LTV,ROI,ROAS,ARPU,ARPPU,...);",
            "Có kinh nghiệm và kỹ năng làm việc với Excel, kỹ năng trực quan hóa các dữ liệu thành dạng biểu đồ.",
            "Có kiến thức về toán học, thống kê và các phương pháp A/B test sản phẩm",
            "Có kinh nghiệm làm việc với cơ sở dữ liệu database, thành thạo SQL, Python là 1 lợi thế (không bắt buộc);",
            "Có kinh nghiệm với các công cụ BI là 1 lợi thế (không bắt buộc);"
        ],
        "suitability": 80
    },
    {
        "title": "Data Analyst Executive",
        "company": "Ninja Van",
        "logo": "https://cdn-new.topcv.vn/unsafe/150x/https://static.topcv.vn/company_logos/Ykd2b8UHfhTTSvxys14IVp7oFKIYcUMk_1655187960____60516e3b2ffd4aa1bca84800e81282d3.png",
        "url": "https://www.topcv.vn/viec-lam/data-analyst-executive/1199404.html?ta_source=JobSearchList_LinkDetail&u_sr_id=PIkV5ZX8AHlKaGbbaZna75jtjAa7bQd3NSbCzvYw_1719855979",
        "location": "Hồ Chí Minh",
        "salary": "Thoả thuận",
        "status": "Cập nhật 3 ngày trước",
        "descriptions": [
            "Building databases, monitoring tables, analyzing operational indicators according to the requirements of the department",
            "Develop and analyze operational and project reports at the request of management levels",
            "Tracking the company's overall goals, allocating them into appropriate target packages for each level of operational management",
            "Provide and monitor solution packages for operations to ensure that the set operating targets are met",
            "Cooperate with departments, coordinate in building and improving operational processes to improve service quality",
            "Consulting, providing risk analysis, operational opportunities for all levels of management",
            "Monitoring, statistics, analysis of cost structures",
            "Cost management, assessment and warning of risks affecting cost structure, room budget",
            "Other tasks to support the management of superiors"
        ],
        "requirements": [
            "Experience/Skills Required:",
            "At least 06 months of experience in managing, building, analyzing operational data or directly managing operations",
            "Requires basic skills in coding, using software, data solutions (Power BI ...)",
            "Good communication skills.",
            "Knowledge of Microsoft Office, Google Drive tools",
            "Self-study sense, careful work and good presentation ability."
        ],
        "suitability": 80
    },
    {
        "title": "Nhân Viên Data Analyst ( Tracking - Optimize)",
        "company": "EDUPIA",
        "logo": "https://cdn-new.topcv.vn/unsafe/150x/https://static.topcv.vn/company_logos/edupia-738d242f1fe18d4bbd6e7dc01d9b31c1-6594db35ebfd5.jpg",
        "url": "https://www.topcv.vn/brand/educa/tuyen-dung/nhan-vien-data-analyst-tracking-optimize-j1343621.html?ta_source=JobSearchList_LinkDetail&u_sr_id=PIkV5ZX8AHlKaGbbaZna75jtjAa7bQd3NSbCzvYw_1719855979",
        "location": "Hà Nội",
        "salary": "10 - 15 triệu",
        "status": "Cập nhật 5 ngày trước",
        "descriptions": [
            [
                "Mô tả công việc",
                "- Tổng hợp, xây dựng cơ sở dữ liệu, báo cáo đa chiều về các chỉ số Marketing - Sale- Đưa ra các cảnh báo về chỉ số đến các bộ phận liên quan- Theo dõi tiến độ thực thi các giải pháp cải tiến các chỉ số của bộ phận Marketing - Sale-  Các công việc khác theo sắp xếp, phân công quản lý trực tiếp."
            ]
        ],
        "requirements": [
            [
                "Yêu cầu ứng viên",
                "- Nam/Nữ  - độ tuổi từ 23- Có tư duy tổ chức dữ liệu tốt, khoa học- Thành thạo công cụ Excel, Google Sheet (Bắt buộc)- Có kinh nghiệm 6 tháng trong phân tích các chỉ số kinh doanh - Trẻ trung, năng động, chịu khó update xu hướng thị trường.- Có kỹ năng làm việc độc lập và làm việc theo nhóm.- Mong muốn được học hỏi, thăng tiến, có tinh thần cầu tiến, có mục tiêu rõ ràng."
            ]
        ],
        "suitability": 80
    },
    {
        "title": "Data Analyst",
        "company": "Công ty TNHH Dịch vụ công nghệ TP",
        "logo": "https://cdn-new.topcv.vn/unsafe/150x/https://static.topcv.vn/company_logos/cong-ty-tp-entertainment-5f87d39d2fb0c.jpg",
        "url": "https://www.topcv.vn/viec-lam/data-analyst/1272382.html?ta_source=JobSearchList_LinkDetail&u_sr_id=PIkV5ZX8AHlKaGbbaZna75jtjAa7bQd3NSbCzvYw_1719855979",
        "location": "Hà Nội",
        "salary": "Thoả thuận",
        "status": "Cập nhật 1 tuần trước",
        "descriptions": [
            "1. Thu thập, xử lý và phân tích dữ liệu",
            "2. Phân tích và báo cáo định kì",
            "3. Đề xuất chiến lược và đánh giá hiệu quả",
            "Trải nghiệm App và đưa ra đề xuất Events cần Tracking.",
            "Thu thập, xử lý dữ liệu từ nhiều nguồn khác nhau liên quan đến sản phẩm (chất lượng content, hành vi người dùng, các chỉ số liên quan đến marketing, performance app,...) để đảm bảo tính chính xác của dữ liệu.",
            "Verify dữ liệu, đảm bảo chất lượng dữ liệu đưa vào phân tích.",
            "Thực hiện các phân tích sâu sắc để hiểu rõ hành vi người dùng, xu hướng sử dụng và các yếu tố ảnh hưởng đến hiệu suất của sản phẩm.",
            "Phát triển và duy trì các báo cáo và dashboard BI để theo dõi hiệu suất của sản phẩm, bao gồm cả các chỉ số chính và các yếu tố quan trọng khác.",
            "Báo cáo chỉ số performance của các hệ thống định kỳ.",
            "Định kỳ thực hiện phân tích thị trường, đối thủ cạnh tranh, người dùng, giúp PM đưa ra quyết định dựa trên dữ liệu thực tế.",
            "Cung cấp thông tin chiến lược và phân tích dữ liệu hỗ trợ quyết định cho các bộ phận khác như Marketing, Phát triển Sản phẩm, Vận hành.",
            "Đề xuất chiến lược và hành động dựa trên những hiểu biết được thu thập từ dữ liệu.",
            "Đánh giá hiệu quả của các chiến lược sản phẩm và các tính năng cụ thể thông qua việc phân tích dữ liệu và đưa ra đề xuất cải thiện."
        ],
        "requirements": [
            "1. Kiến thức",
            "2. Kỹ năng",
            "3. Tố chất",
            "Hiểu biết sâu rộng về hệ quản trị cơ sở dữ liệu SQL, My SQL và công cụ BI như Power BI, Tableau hoặc các công cụ tương tự.",
            "Có khả năng học hỏi và nghiên cứu sử dụng các tools để research thị trường.",
            "Sự hiểu biết vững về nguồn dữ liệu, Data warehousing, và khả năng áp dụng dữ liệu vào quyết định kinh doanh.",
            "Có kinh nghiệm làm BI cho các sản phẩm Digital là một lợi thế.",
            "Có tối thiểu 1 năm kinh nghiệm tại vị trí tương đương, đặc biệt là nghiên cứu sản phẩm, nghiên cứu người dùng.",
            "Tốt nghiệp đại học chuyên ngành kỹ thuật, kinh tế.",
            "Kỹ năng phân tích và trình bày báo cáo tốt.",
            "Khả năng viết tốt, biến dữ liệu thành thông điệp dễ hiểu và thuyết phục.",
            "Sự nhanh nhạy trong việc nắm bắt thông tin từ thị trường và phản ánh nó thành chiến lược kinh doanh.",
            "Kỹ năng tổng hợp, phân tích và đánh giá dữ liệu tốt.",
            "Tinh thần tự học hỏi và phát triển bản thân; cẩn thận, trách nhiệm, nghiêm túc với công việc.",
            "Thích trải nghiệm sản phẩm công nghệ.",
            "Là người cẩn thận, tỉ mỉ trong công việc, đảm bảo dữ liệu được chính xác",
            "Sáng tạo, nhạy bén, bắt trend nhanh.",
            "Tư duy lấy người dùng làm trung tâm. Biết đặt mình vào vị trí khách hàng, đề cao trải nghiệm khách hàng.",
            "Tư duy tích cực, chủ động; tinh thần giúp đỡ, cùng nhau thúc đẩy team phát triển."
        ],
        "suitability": 100
    },
    {
        "title": "Data Analyst",
        "company": "Công Ty Tài Chính TNHH Một Thành Viên Home Credit Việt Nam",
        "logo": "https://cdn-new.topcv.vn/unsafe/150x/https://static.topcv.vn/company_logos/cong-ty-tai-chinh-tnhh-mot-thanh-vien-home-credit-viet-nam-5b7100af1f634_rs.jpg",
        "url": "https://www.topcv.vn/viec-lam/data-analyst/1355502.html?ta_source=JobSearchList_LinkDetail&u_sr_id=PIkV5ZX8AHlKaGbbaZna75jtjAa7bQd3NSbCzvYw_1719855979",
        "location": "Hồ Chí Minh",
        "salary": "Thoả thuận",
        "status": "Cập nhật 4 tuần trước",
        "descriptions": [
            "If you enjoy working with data and finding their insights to support driving business success, this opportunity will be a good match for your long-term career growth.Your insightful stories from data will serve as a key driver for business initiatives.",
            "Work with key business owners to conduct business budgeting, forecasting, planning and adoption of new technologies for process optimization and long-term business objectives.",
            "Gain hands-on experience and mentorship from your line manager, buddy & other top business leaders to work on practical projects and drive business initiatives."
        ],
        "requirements": [
            "University graduate with GPA of 3/4 and 7.5/10 with less than 1-year working experience.",
            "Proficient in English with a level of IELTS 6.5 or equivalent.",
            "Proficiency in SQL or other programming languages to accelerate your development faster.",
            "Passion for numbers & data analysis",
            "Strong logical thinking, problem-solving skills, communication skills & presentation skills to detect the business situation then propose positive changes.",
            "Effectively work both in a team & on your own.",
            "Willingness to learn & absorb new knowledge.",
            "Good Customer Obsession, Entrepreneurship, Integrity, Operation Excellence & Digital Savviness mindset as it’s our core Leadership Qualities."
        ],
        "suitability": 80
    }
]