[
    {
        "title": "Fullstack Developer (Java/ ReactJS/SQL) - All Level",
        "company": "MB Bank",
        "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBMmZvSXc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--88c82102b4c6782414b90e4077f75449b9789560/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJY0c1bkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--c8c20c63b868249effdba9ba4f05aa0c5b77cab3/Logo%20MB%20he%20mau%20RGB%2001.png",
        "url": "https://itviec.com//it-jobs/fullstack-developer-mysql-java-reactjs-all-level-mb-bank-3701?lab_feature=preview_jd_page",
        "location": "Ha Noi",
        "mode": "At office",
        "descriptions": "- Lập trình, phát triển các hệ thống, ứng dụng của Ngân hàng.\n- Phát triển hoặc phối hợp cùng các nhà cung cấp phát triển và triển khai các giải pháp CNTT.\n- Quản lý, phát triển dịch vụ tích hợp với các hệ thống core như: T24, WAY4, BPM, CRM, CIC ...\n- Nghiên cứu, thử nghiệm, triển khai áp dụng các xu hướng công nghệ mới vào việc phát triển: GraphQL, Docker Container (K8s), CICD, EventSourcing, CQRS, NoSQL ...\n- Duy trì hoạt động của các sản phẩm dịch vụ trong phạm vi quản lý.\n- Tham gia phân tích nghiệp vụ, đề xuất giải pháp, phương án triển khai nhằm cải tiến, nâng cao hiệu quả của các dự án trong quá trình làm việc.\n- Lên timeline công việc, chia tasks cho các thành viên trong nhóm, giám sát và hỗ trợ các thành viên hoàn thành đúng cam kết.\n- Dẫn dắt nhóm 03-06 nhân sự, giúp thành viên cùng phát triển và hoàn thành nhiệm vụ được giao.- Junior Fullstack Developer:\n- Senior Fullstack Developer:Bổ sung các nhóm công việc sau:",
        "requirements": "- Tốt nghiệp Đại học chính quy các chuyên ngành Công nghệ thông tin, Khoa học máy tính, Điện tử viễn thông, Công nghệ phần mềm, Hệ thống thông tin ...\n- Thành thạo tiếng Anh (TOEIC 450 trở lên hoặc tương đương).\n- Hiểu biết về quy trình phát triển phần mềm và quen thuộc với tư duy làm việc Agile.\n- Tối thiểu 01 năm kinh nghiệm làm việc tại các công ty, dự án về lập trình Fullstack.\n- Thành thạo ít nhất 01 trong các ngôn ngữ BackEnd (VD: Java, NodeJS) và FrontEnd frameworks (VD:Angularjs, ReactJS).\n- Thành thạo ít nhất 01 trong các loại database: Oracle, SQLserver, PostgreSQL, Mongodb ...\n- Hiểu biết về restful, GraqpQL.\n- Có kinh nghiệm trong mảng tài chính ngân hàng là một lợi thế.\n- Tối thiểu 03 năm kinh nghiệm làm việc tại các công ty, dự án về lập trình BackEnd; trong đó, tối thiểu 01 năm kinh nghiệm làm việc với microservices.\n- Hiểu biết sâu về các kỹ thuật/công nghệ: MySQL, Redis, MongoDB, PostgreSQL, Kafka …\n- Có khả năng tuning performance của ứng dụng, hệ thống.\n- Có kinh nghiệm phát triển, sử dụng cloud, FrontEnd là một lợi thế.- Yêu cầu chung:\n- Đối với ứng viên Junior:\n- ​Đối với ứng viên Senior:Bổ sung các điều kiện:"
    },
    {
        "title": "Full-stack Developer (.Net ,HTML5,AngularJS)",
        "company": "Âu Việt Soft",
        "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBeFZNR2c9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--51e3c50d7308df93cee11b2300a4b56b7aed5385/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJYW5CbkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--e064c7b4667a202bc74d582f9581c9a645d77ae5/logo.jpg",
        "url": "https://itviec.com//it-jobs/full-stack-developer-net-au-viet-soft-5920?lab_feature=preview_jd_page",
        "location": "Ho Chi Minh",
        "mode": "At office",
        "descriptions": "- Lập trình cho các dự án phát triển và bảo trì phần mềm theo sự phân công của người đứng đầu dự án.\n- Làm từ frontend qua backend và database => Tham gia với vai trò full stack developer\n- Báo cáo cho Trưởng dự án\n- Cấp bậc: Nhân viên\n- Nơi làm việc: Hồ Chí Minh- Để đáp ứng nhu cầu phát triểm mạnh mẽ của công ty, Au Viet Soft đang tìm kiếm những lập trình viên tài năng để tham gia vào nhóm của chúng tôi. Đây là một cơ hội tuyệt vời để tích lũy kinh nghiệm trong ngành và học hỏi những công nghệ mới. Auviet soft sẽ mang đến cho người phù hợp cơ hội nghề nghiệp tuyệt vời với mức lương và lợi ích cạnh tranh.\n- TỔNG QUAN",
        "requirements": "- Có kiến thức lập trình với ASP.NET MVC 5, HTML, jQuery, Angular JS, Entity Framework, MS SQL, XML và mô hình lập trình nhiều lớp.\n- Yêu cầu ứng viên từ 1 năm kinh nghiệm\n- Có tinh thần trách nhiệm, phong cách làm việc năng động với khả năng làm việc độc lập hoặc theo nhóm.\n- Không yêu cầu Tiếng Anh"
    },
    {
        "title": "Fullstack Developers C#, Angular, .Net Core",
        "company": "Snap Research Labs",
        "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBMGl6SEE9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--cbbdc07fd1314592affe4301c959ca7605eae6c9/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJYW5CbkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--e064c7b4667a202bc74d582f9581c9a645d77ae5/photo_2021-03-16_16-37-18.jpg",
        "url": "https://itviec.com//it-jobs/fullstack-developers-c-angular-net-core-snap-research-labs-5748?lab_feature=preview_jd_page",
        "location": "Ho Chi Minh",
        "mode": "At office",
        "descriptions": "- We are looking for Fullstack C#, Angular, .NET Core Developers to join our growing team. You will work for our in-house products (Trading, AI, Blockchain).",
        "requirements": "- Be honest, disciplined person, focus on work even when your boss is not watching you.\n- Report to managers actively.\n- Write report documentation in English (if required).\n- Have production mindset.\n- Must love to work with numbers and calculation\n- Must have Bachelor Degree in Computer Science or Information Technology\n- Strong knowledge in Data structures, Algorithms, Multi-threading\n- At least 2 years of experience working with C#, Typescript, Javascript\n- At least 2 years working with ASP.NET Core, Angular, CSS, HTML, NodeJS\n- At least 2 years working with PostgreSQL, MSSQL\n- Have experience in CI/CD, Docker, Linux\n- Solid background in OO paradigm: Object-Oriented Programming, Object-Oriented Design\n- Familiar with Jira, Git, Test Driven Development (TDD)\n- Can code Python is a plus\n- Knowledge in crypto, blockchain\n- Knowledge in trading- RESPONSIBILITIES\n- \n- YOUR SKILLS AND EXPERIENCE:\n- Nice to have, but not required:"
    },
    {
        "title": "Java Web Full-Stack Developer (Spring Boot)",
        "company": "DTS Software Vietnam",
        "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBNlUrS2c9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--76a04d3fde6e48f59893ee3177bfa0e000c09685/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJY0c1bkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--c8c20c63b868249effdba9ba4f05aa0c5b77cab3/DTS%20Logo.png",
        "url": "https://itviec.com//it-jobs/java-web-full-stack-developer-spring-boot-dts-software-vietnam-5633?lab_feature=preview_jd_page",
        "location": "Ha Noi",
        "mode": "At office",
        "descriptions": "- - Tham gia phát triển dự án web lớn cho các tổ chức tài chính, bất động sản, hàng không etc..sử dụng java Spring boot\n- - Viết Code và thực hiện Unit Test theo tài liệu thiết kế chi tiết và tài liệu đặc tả test (testcase)\n- - Điều tra và tư vấn giải pháp kỹ thuật khi được yêu cầu\n- - Hỗ trợ team test thực hiện IT/ST\n- - Nghiên cứu và phát triển các công nghệ mới phục vụ nhu cầu phát triển của công ty\n- - Những công việc khác theo phân công của cấp quản lý",
        "requirements": "- Kinh nghiệm thực tế từ 1 năm trở lên về phát triển web sử dụng java spring boot, thymeleaf\n- Sử dụng thành thạo công cụ Eclipse/IntelliJ, SVN/GIT\n- Có kinh nghiệm làm Native SQL, đặc biệt là các câu truy vấn dữ liệu phức tạp, biết một trong cácORM (JPA/Hibernate, GroovySQL, mybatis etc..)\n- Tư duy logic tốt, có kỹ năng giải quyết vấn đề, tích cực học hỏi cái mới và có kỹ năng làm việc nhóm\n- Có kinh nghiệm làm fullstack (frontend&backend)\n- Biết tiếng Nhật, hoặc đã từng làm việc ở các công ty IT có liên quan đến Nhật Bản\n- Có khả năng tự học tốt, tư duy tốt, chịu được áp lực công việc cao\n- Dưới 35 tuổi\n- Biết viết thiết kế hoặc thực hiện các nhiệm vụ đa dạng khác ngoài Code & UT\n- Sẵn sàng đi onsite bên công ty khách hàng (trong và ngoài việt nam) khi được yêu cầu.- .Bắt buộc\n- Ưu tiên nếu"
    },
    {
        "title": "Fullstack Developer (NodeJS, ReactJS)",
        "company": "Sunbytes",
        "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBemRuTWc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--89d7be887704f373884b842c4e98a4e3d2ab9e8a/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJYW5CbkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--e064c7b4667a202bc74d582f9581c9a645d77ae5/Sunbytes%20Square%20Logo.jpg",
        "url": "https://itviec.com//it-jobs/fullstack-developer-nodejs-reactjs-sunbytes-4238?lab_feature=preview_jd_page",
        "location": "Ho Chi Minh",
        "mode": "At office",
        "descriptions": "- About Sunbytes\n- Sunbytes is a leading technology consulting firm that delivers innovative and scalable software solutions. We have a strong reputation in the industry for delivering high-quality products and are committed to providing a supportive and challenging work environment for our members. Our team is composed of talented and experienced software engineers, project managers, and business consultants from around the world.\n- At Sunbytes, we believe in providing opportunities for growth and career development, and we are always looking for talented individuals to join our team. Our client-focused approach and commitment to delivering the best possible solutions for our clients make Sunbytes an exciting place to work, and a great opportunity for Developers looking for a challenging and rewarding role.\n- \n- About the Role:\n- Sunbytes is looking for a full-timeFullstack NodeJS Developerwith at least 3+ years of experience. Our client comprises talented developers in Viet Nam, working with the Netherlands team to deliver innovative software solutions for one of the largest Health Platforms used in The Netherlands\n- \n- As aFullstack NodeJS Developer,you are expected to have a strong background and a solid understanding of fullstack development principles to support a team of developers in building high-quality web applications in the Healthcare domain.",
        "requirements": "- Bachelor's degree in Computer Science or a related field.\n- 5+ years of experience in TypeScript development.\n- Experience with Node.js (Nestjs), Next.js, and React.\n- Strong independent work ethic and ability to work autonomously on tasks.\n- Excellent English language skills, both written and verbal.\n- Strong problem-solving skills and ability to take initiative independently.\n- Enthusiasm for innovation and continuous skill development.\n- MongoDB\n- gRPC\n- Next.JS\n- Remix.JS\n- BIT\n- GraphQL\n- Experience with microservice architecture- Must have skills:\n- Nice to have skills:"
    },
    {
        "title": "Full-stack Developer (.NET Core, C#, TypeScript, Vue 3)",
        "company": "OMNIA SYSTEMS COMPANY LIMITED",
        "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBK3ZhU3c9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--3849bdc48ebbb7b84a46e92df41a7d13df7fdcf2/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJY0c1bkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--c8c20c63b868249effdba9ba4f05aa0c5b77cab3/OMNIA_LOGO_Black%201.png",
        "url": "https://itviec.com//it-jobs/full-stack-developer-net-core-c-typescript-vue-3-omnia-systems-company-limited-2915?lab_feature=preview_jd_page",
        "location": "Ho Chi Minh",
        "mode": "At office",
        "descriptions": "- Design and develop web solutions based on Microsoft 365, Azure AKS, and SharePoint.\n- Extend the standard capabilities of Microsoft 365 using the latest web technologies, such as Vue3 and TypeScript.\n- Troubleshooting and problem-solving.\n- Communicate with team members across country borders to discuss and resolve project issues.\n- Be a creative and positive member of the team.- You are a true team player who wants to work in an international team together with some of the best architects and developers. The company that you will be working for has been on the frontline of advanced Office365, Azure, Web, and SharePoint development for many years.\n- \n- You will be trained by senior and experienced developers in Omnia Systems Vietnam and receive extensive training including an education package with trips to Europe for one month.\n- \n- Omnia Systems Vietnamis looking for Full-stack Developers (.NET Core, C#, TypeScript, Vue 3) as follows:\n- \n- Your responsibilities/Nhiệm vụ:",
        "requirements": "- Minimum 1 year of professional experience as a developer working in the below fields:\n- Strong in OOP and Typescript/JavaScript.\n- Good communication in English\n- CV in English\n- Experience in SharePoint/Microsoft 365 development\n- Experience in agile projects such as Scrum\n- Experience from working in international teams- Requirement/Yêu cầu\n- - NET Core, .NET Framework, and Entity Framework\n- - JavaScript/TypeScript libraries and frameworks, such as npm, VueJS, React\n- \n- Nice to have/Rất tốt nếu có thêm kinh nghiệm"
    },
    {
        "title": "Fullstack Developer (Golang, Python, VueJS)",
        "company": "LeanBase",
        "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBNW9FVEE9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--db4a688b7d9e61d840d5cb6b5cc550630dc49470/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJYW5CbkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--e064c7b4667a202bc74d582f9581c9a645d77ae5/LeanBase%20-%20Linh%20Nguyen.jpg",
        "url": "https://itviec.com//it-jobs/fullstack-dev-python-vuejs-mysql-leanbase-3532?lab_feature=preview_jd_page",
        "location": "Ha Noi",
        "mode": "Hybrid",
        "descriptions": "- ABOUT THE ROLE\n- As a key member, you will play a pivotal role in the development of our new B2B software product. Working closely with our cross-functional team, you will be responsible for designing, implementing, and maintaining both the front-end and back-end components of the application. Your expertise will be instrumental in shaping the user experience, optimizing performance, and ensuring the scalability and reliability of this new one.\n- JOB DESCRIPTION\n- ● Collaborate with product managers, designers, and other stakeholders to understand project requirements and translate them into technical specifications.\n- ● Design and develop scalable and efficient back-end systems using Python and Django.\n- ● Create responsive and user-friendly front-end interfaces using Vue.js and other modern web technologies.\n- ● Implement and maintain RESTful APIs for seamless communication between front-end and back-end components.\n- ● Write clean, efficient, and well-documented code that adheres to best practices and coding standards.\n- ● Conduct thorough testing to ensure the reliability, security, and performance of the applications.\n- ● Continuously optimize and improve the functionality and user experience of existing applications.\n- ● Stay updated on emerging technologies and industry trends to drive innovation and enhance our development processes.",
        "requirements": "- ● Possess2+ years of experience.\n- ● Bachelor's degree in Computer Science, Engineering, or a related field.\n- ● Proven experience as a Full Stack Developer or similar role.\n- ● Strong proficiency in Golang, Python, Django, Vue.js, and other relevant technologies.\n- ● Experience with front-end development frameworks/libraries (e.g., React, Angular) is a plus.\n- ● Knowledge of web development best practices and design patterns.\n- ● Familiarity with database systems such as PostgreSQL, MySQL, or MongoDB.\n- ● Excellent problem-solving skills and attention to detail.\n- ● Ability to work independently and collaboratively in a fast-paced environment.\n- ● Strong communication and interpersonal skills.\n- ● A passion for learning and staying updated on new technologies and trends in the industry."
    },
    {
        "title": "Fullstack .NET Developer (ReactJs, Javascript)",
        "company": "Restaff – House Of Norway",
        "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBek5RTFE9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--682325f46b08597ea5c07b2fef069df211d4fbb6/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJYW5CbkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--e064c7b4667a202bc74d582f9581c9a645d77ae5/306256501_492850036191604_7787949746347557281_n.jpg",
        "url": "https://itviec.com//it-jobs/fullstack-net-developer-reactjs-restaff-house-of-norway-2526?lab_feature=preview_jd_page",
        "location": "Ho Chi Minh",
        "mode": "Hybrid",
        "descriptions": "- Wellbarrier – ASLBTechnology, the largest energy services company in the world.\n- Wellbarrier is a very well-known product in the energy industry, which has been used by almost the largest oil & gas companies from 67 countries around the world.\n- We provide the energy industry with unique web solutions for a sustainable future, using the most recent technology like.NET 6, ASP.NET Core, TypeScript, React, Nodejs, multi-tenant\n- The solutions we deliver aim to satisfy the needs that no one else has seen, and we are good at it because we think differently. We are a proactive team that takes the initiative to deliver smart solutions and actively takes part in all areas of development. We, as a team, take more than one step outside the box to discover new ways and take advantage of technology to reach the outcome we want.\n- Our success comes from mutual respect, we make the best choices by exploring many ways to reach the same goal. The management knows the best solutions appear when the team can perform their excellence. Our customers around the world call us#thebestteamever.\n- Work and collaborate in an Agile environment with experienced and skilled colleagues in Vietnam and Europe.\n- Participate in the entire software development life cycle of the Agile team (requirement analysis, planning, architectural design, documentation, implementation, code review, unit test…)\n- Build Web Applications using.NET 6, TypeScript, React, Nodejs.\n- Build RESTful API to connect with the integrated ecosystem.\n- Build SDK/libraries to share with other parties.\n- Research new technologies, techniques, and standards to improve the productivity of the dev team.\n- Participate in mentoring & code reviews.\n- Plan and organize your own work and accurately report issues and progress in a timely manner.\n- You find motivation in opportunities, are constantly curious, and seek to learn new things.\n- You take initiative and have pride in your work.\n- To see the big picture is important to you, and never settle without understanding the purpose.\n- As a teammate, you contribute to the team's success and enjoy when a co-worker succeeds.\n- You have an extra-strong desire for some of your professional areas and skills.\n- You want to be a part of an Agile team, working with innovative products and technologies.- ABOUT THE TEAM​\n- WE ARE LOOKING FOR A PERSON, WHO WILL​\n- PERSONAL TRAITS​",
        "requirements": "- At least 3 years of working experience in web development using .NET/. NET core.\n- Proficient with React, TypeScript.\n- Strong experience with Restful API.\n- Familiar with MS SQL/Azure SQL / Entity framework.\n- Strong at software design SOLID, Design Patterns, etc.\n- Good at technical problem-solving & logical thinking.\n- Self-organizational, flexible, supportive, and multitasking.\n- Continuous learning attitude and growth mindset.\n- Confident with communication in English.\n- Experienced withNodeJS.\n- Experienced withIntegrated solutions, Docker, and Kubernetes.\n- Experienced with Agile/Scrum team.\n- Performance Optimization, Software Security, and UI/UX.\n- Unit test/ /CI/CD.\n- Experienced in European company.- A POTENTIAL CANDIDATE WILL HAVE\n- MUST HAVE:\n- Good to have:"
    },
    {
        "title": "[THU DUC - HCMC] JAVA Fullstack Developer",
        "company": "Next Chain Tech",
        "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBOGllTkE9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--9788790095da5169f567de2b8fd1096000425cb0/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJYW5CbkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--e064c7b4667a202bc74d582f9581c9a645d77ae5/ad52f70e1a79c6279f68%20-%20Tin%20Nguyen.jpg",
        "url": "https://itviec.com//it-jobs/thu-duc-hcmc-java-fullstack-developer-next-chain-tech-3530?lab_feature=preview_jd_page",
        "location": "Ho Chi Minh",
        "mode": "At office",
        "descriptions": "- Thảo luận công việc phải bắt đầu bằng việc định nghĩa vấn đề là gìDiscussion must start with problem define\n- Chúng tôi đề cao sức mạnh của làm việc nhómWe believe teamwork power\n- Nhân viên phải có trách nhiệm với công việc của mìnhWe must have responsibility of own work\n- Việc làm hôm nay, phải tốt hơn ngày hôm quaWe must be better than yesterday- Job Description\n- Chúng tôi cần tuyển 01 lập trình viên Java FullStack có kinh nghiệm + 3 năm và mong muốn làm việc lâu dài với chúng tôi.\n- \n- We need 01 JAVA Fullstack Developer who has + 3y experience and wish to work long-term with .Văn hoá Dev tại Nextchain:\n- Dev Culture in Nextchain:\n- * Chúng tôi không thích những nhân viên không đặt câu hỏi trong quá trình làm việc\n- We do not like who do not have question during working\n- \n- ",
        "requirements": "- Tốt nghiệp Cao đẳng/Đại học chuyên ngành Công nghệ thông tin/Máy tính.\n- Graduated from College/University in Information Technology/Computer.\n- Ít nhất 3 năm kinh nghiệm sử dụng JAVA ( bắt buộc*)\n- At least  3 years experiences in using JAVA (springboot) ( required*)\n- Thiết kế, phát triển và vận hành Backend của hệ thốngDesign, develop and operate the system's Backend\n- Lập trình springbootProgramming springboot\n- Sử dụng cơ sở dữ liệu liên hệUsing Relations Database\n- Java 6\n- HTML5\n- Springboot programming\n- Apache Maven, Apache Ant, Apache Jasper\n- Relational Database (mainly Mysql or Oracle),\n- Cubrid database,\n- Servlet 3.0 container (Jeus or Tomcat 7).- Kinh nghiệm và Kỹ năng /Your Skills and Experience\n- \n- 2. KINH NGHIỆM KỸ THUẬT / TECHNICAL EXPERIENCES\n- \n- PHẢI CÓ / MUST HAVE\n- \n- \n- ĐIỂM CỘNG NẾU CÓ / NICE TO HAVE\n- \n- \n- 3. KỸ NĂNG NGOẠI NGỮ / LANGUAGE SKILLS\n- \n- Có thể giao tiếp Tiếng Anh cơ bản (Đọc viết)\n- Communicate basically in English  (writing, reading)\n- "
    },
    {
        "title": "Fullstack Developer (Angular, VueJS, NodeJS)",
        "company": "Công Ty Cổ Phần Xu Hướng Mạng (Network on Trending)",
        "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBKytRU3c9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--2db6d32942cfefad032e5848cfcd2402f405d5eb/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJY0c1bkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--c8c20c63b868249effdba9ba4f05aa0c5b77cab3/LOGO%20ON%20TRENDING-03.png",
        "url": "https://itviec.com//it-jobs/fullstack-developer-angular-vuejs-nodejs-cong-ty-co-phan-xu-huong-mang-network-on-trending-0132?lab_feature=preview_jd_page",
        "location": "Ho Chi Minh",
        "mode": "At office",
        "descriptions": "- Front-End Development:Develop and enhance web applications using HTML, CSS, JavaScript, and frameworks like React, Angular, or Vue.js.Ensure the technical feasibility of UI/UX designs and optimize applications for maximum speed and scalability.Troubleshoot and debug issues to improve application performance.\n- Develop and enhance web applications using HTML, CSS, JavaScript, and frameworks like React, Angular, or Vue.js.\n- Ensure the technical feasibility of UI/UX designs and optimize applications for maximum speed and scalability.\n- Troubleshoot and debug issues to improve application performance.\n- Back-End Development:Develop server-side logic, APIs, and services using languages such as Node.js, Python, Ruby, Java, or PHP.Design and manage databases, ensuring data integrity and optimal performance.Implement security and data protection measures.\n- Develop server-side logic, APIs, and services using languages such as Node.js, Python, Ruby, Java, or PHP.\n- Design and manage databases, ensuring data integrity and optimal performance.\n- Implement security and data protection measures.\n- Database Management:Work with SQL and NoSQL databases like MySQL, PostgreSQL, MongoDB, etc.Perform database optimization and maintain data consistency.\n- Work with SQL and NoSQL databases like MySQL, PostgreSQL, MongoDB, etc.\n- Perform database optimization and maintain data consistency.\n- Integration & Deployment:Integrate front-end and back-end components seamlessly.Work with DevOps to set up continuous integration and deployment (CI/CD) pipelinesMonitor and troubleshoot applications to ensure smooth operation post-deployment.\n- Integrate front-end and back-end components seamlessly.\n- Work with DevOps to set up continuous integration and deployment (CI/CD) pipelines\n- Monitor and troubleshoot applications to ensure smooth operation post-deployment.\n- Collaboration & Communication:Collaborate with product managers, designers, and other developers to understand project requirements and deliver solutions.Provide support and mentorship to junior developers.Participate in code reviews and contribute to the improvement of coding standards and best practices.\n- Collaborate with product managers, designers, and other developers to understand project requirements and deliver solutions.\n- Provide support and mentorship to junior developers.\n- Participate in code reviews and contribute to the improvement of coding standards and best practices.\n- Develop and enhance web applications using HTML, CSS, JavaScript, and frameworks like React, Angular, or Vue.js.\n- Ensure the technical feasibility of UI/UX designs and optimize applications for maximum speed and scalability.\n- Troubleshoot and debug issues to improve application performance.\n- Develop server-side logic, APIs, and services using languages such as Node.js, Python, Ruby, Java, or PHP.\n- Design and manage databases, ensuring data integrity and optimal performance.\n- Implement security and data protection measures.\n- Work with SQL and NoSQL databases like MySQL, PostgreSQL, MongoDB, etc.\n- Perform database optimization and maintain data consistency.\n- Integrate front-end and back-end components seamlessly.\n- Work with DevOps to set up continuous integration and deployment (CI/CD) pipelines\n- Monitor and troubleshoot applications to ensure smooth operation post-deployment.\n- Collaborate with product managers, designers, and other developers to understand project requirements and deliver solutions.\n- Provide support and mentorship to junior developers.\n- Participate in code reviews and contribute to the improvement of coding standards and best practices.- We are seeking a talented and motivated Middle Full Stack Developer who is proficient in both front-end and back-end development. The ideal candidate will be responsible for designing, developing, and maintaining web applications, ensuring responsiveness and performance. This role involves collaborating with cross-functional teams to deliver high-quality software solutions.\n- Key Responsibilities:",
        "requirements": "- Bachelor’s degree in computer science, Information Technology, or a related field.\n- 3-5 years of experience as a Full Stack Developer or in a similar role.\n- Proficiency with front-end frameworks like React, Angular, or Vue.js.\n- Strong back-end development skills with Node.js, Python, Ruby, Java, PHP, or similar.\n- Experience with database management systems such as MySQL, PostgreSQL, MongoDB, etc.\n- Familiarity with version control systems like Git.\n- Strong analytical and problem-solving skills.\n- Excellent communication and teamwork abilities.\n- Ability to manage multiple tasks and work independently.\n- Familiarity with cloud services like AWS, Google Cloud, or Azure is a plus.\n- Knowledge of agile methodologies and experience with project management tools like Jira or Trello.- Education:\n- Experience:\n- Skills:"
    },
    {
        "title": "Fullstack Developer (JavaScript/ReactJS/NodeJS)",
        "company": "GOSOURCE",
        "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBMzVUTEE9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--524f8a76d94a53c4d81b91c0a2977b5b8332eb8c/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJY0c1bkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--c8c20c63b868249effdba9ba4f05aa0c5b77cab3/11141784.png",
        "url": "https://itviec.com//it-jobs/fullstack-developer-javascript-reactjs-nodejs-gosource-2516?lab_feature=preview_jd_page",
        "location": "Ho Chi Minh",
        "mode": "Hybrid",
        "descriptions": "- Collaborate with the team to clarify and analyze project requirements\n- Design and develop new processes and features, and iterate the solution by incorporating user research and business feedback\n- Ensure that developed applications are well documented, tested, easy to maintain, and meet industry standards\n- Develop and conduct code reviews with both local and distributed team members.- About Us\n- GoSource is an Australian-owned and operated company that designs, builds, and manages digital services and applications. We are a digital native and agile organization with an exceptional track record in delivering digital services that positively impact Australian society.\n- \n- Since 2013, our business has evolved into a leading digital transformation partner of government and enterprises with an enviable reputation for always delivering. Our projects often address essential national and international concerns and include modern tech like serverless, blockchain, verifiable credentials, offline first native apps, and more.\n- \n- In February 2023, GoSource established a new office in Ho Chi Minh City and commenced its operation the following April, marking an exciting new chapter in Vietnam. Our staff value the trust, flexibility, and generous benefits we provide them. The company works hard to provide career stability, invests in ongoing professional development, and maintains a social fabric where talented people thrive professionally and live comfortably. We are committed to providing competitive salaries, competitive benefits packages, and lifestyle careers that allow our new Vietnamese colleagues to live well while they pursue fantastic careers. We will negotiate a package that is tailored to your needs and aspirations, which will include ongoing training and perhaps some international travel too. At GoSource, skills and capability speak louder than labels. We’re here for your talent and the unique perspective you bring to the team.\n- \n- We are looking for a skilled Fullstack Developer who is highly motivated, innovative, and can work collaboratively in a multi-disciplinary team\n- \n- Responsibilities:",
        "requirements": "- Minimum of 3 years of experience (mid-level) writing well-documented, clean JavaScript/TypeScript code\n- Minimum of 3 years of experience (mid-level) with React.js and Node.js\n- Experience with version control and source code management systems such as Git and GitHub\n- Good communication skills in both spoken and written English.\n- Bachelor's degree in Computer Science or Software Engineering, or a relevant field\n- Familiar with designing and building full-stack modern web applications\n- Familiar with or understanding AWS architecture patterns and services.- Requirements:\n- Desired:"
    },
    {
        "title": "Fullstack Developer (.NET, C#, English)",
        "company": "Optimizely (formerly Episerver)",
        "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBN3VmSGc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--60621c52ddcfec355f1a1a9ebc8ed2d79256c18e/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJY0c1bkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--c8c20c63b868249effdba9ba4f05aa0c5b77cab3/logo_symbol_1200x1200.png",
        "url": "https://itviec.com//it-jobs/fullstack-developer-net-c-optimizely-formerly-episerver-3925?lab_feature=preview_jd_page",
        "location": "Ha Noi",
        "mode": "At office",
        "descriptions": "- Develop, maintain and run back-end and front-end applications using C# (Netcore/.NetFramework), Javascript/ReactJs, ASP.NET MVC, Docker and Azure cloud platform.\n- Test-driven development with high quality standards.\n- Contribute in architecture discussions, ideas for products.- Optimizely is focused on unlocking the boundless potential of our clients and employees. We are a category leader in Digital Experience Platform (DXP) and have the pleasure of serving over 9,000 brands, from global organizations such as Visa, Sky, Yamaha, and Wall Street Journal to tech innovators like Atlassian DocuSign, FitBit, and Zillow.\n- Optimizely fosters an inclusive and diverse culture with a global team of 1500+ people spread across the US, Europe, Dubai, Australia, Singapore, Bangladesh, and Vietnam. Our unique work environment focuses on flexibility, trust, teamwork, diversity, and moving fast.\n- We genuinely believe that our people make all the difference, and once we find the best talent, we go out of our way to nurture them.  If you are looking to work on the next generation of digital technologies in a fast-paced and growing environment with industry leaders, Optimizely is the place for you!\n- As a Full-stack .Net Developer, you will:",
        "requirements": "- At a minimum, you should have a bachelor’s degree in software development or equivalent\n- You should have at least 3 years of experience in Microsoft .NET C# programming and web development, both front-end and back-end.\n- It is beneficial if you have experience working with ReactJs.\n- It is beneficial if you also have experience in CMS and E-commerce.\n- You are enthusiastic about new cloud technology.\n- Good skills in English, both written and spoken"
    },
    {
        "title": "Full-stack Developer (.NET + Angular)",
        "company": "DEK Technologies",
        "logo": "https://itviec.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBMkZHUGc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--66c4982be85ebf7ffab2649aec630744bd4ec47c/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJY0c1bkJqb0dSVlE2RW5KbGMybDZaVjkwYjE5bWFYUmJCMmxwYVdrPSIsImV4cCI6bnVsbCwicHVyIjoidmFyaWF0aW9uIn19--c8c20c63b868249effdba9ba4f05aa0c5b77cab3/DEK-anEndavaCompany-Dark%20(2).png",
        "url": "https://itviec.com//it-jobs/full-stack-developer-net-angular-dek-technologies-4336?lab_feature=preview_jd_page",
        "location": "Ho Chi Minh",
        "mode": "Hybrid",
        "descriptions": "- \n- As a full-stack developer (.NET + Angular), you will be challenged to work alongside passionate individuals, who always strive to continuously improve and who share the same vision on what \"done\" work signifies.\n- \n- You will be a member of a team that interacts frequently with the client and the team members from other locations. You will work in an agile environment, closely with the business team in order to understand what the product is supposed to do and what its key features are.\n- \n- You will be planning and lead in both supporting the team to build a product that brings value to our client and in verifying that the product works as expected.\n- \n- As a full-stack developer (.NET + Angular) on the team, you will be implementing requirements using the best technical solutions available.  In order to implement the best solutions, you will need to be well informed of the latest technologies and trends in software development.\n- \n- You will solve complex technical problems that other team members may encounter, be an integral part of a Scrum team.\n- \n- You will be exposed to a variety of challenges, from technical solutions and design to improving service delivery from an end-to-end perspective.",
        "requirements": "- 3+ years of experience working on commercial projects using .NET.\n- 2+ years of experience working on commercial projects using Angular.\n- .NET Framework/CORE development.\n- Messaging Patterns (Message Bus or Kafka or Apache Camel) experience.\n- Threading/Async patterns.\n- Ability to integrate and work with a relational Database (SQL).\n- Version control system experience (TFS/GitHub/GitLab).\n- The ability to write and understand the benefits of unit, integration, system & end-to-end testing.\n- Follow design principles & patterns (SOLID, dependency injection), quality standards.\n- Client facing competencies (good English, communication skills).\n- Full-stack profile will be advantages.\n- Ability to blend with people from various social & cultural backgrounds.\n- Sociable, proactive, team player.\n- Fast learner.\n- Agile processes knowledge and experience.\n- Time management skills, embracing change.\n- Ability to coach others.- Mandatory skills:\n- \n- Additional competencies relevant to position:"
    }
]