[
    {
        "title": "Nhân Viên Xử Lý Dữ Liệu (Dữ Liệu Về Hiệu Suất Hoạt Động, Chỉ Tiêu, Không Phải Vị Trí Data Analyst)",
        "company": "CÔNG TY CỔ PHẦN CÔNG NGHỆ HỢP LONG",
        "logo": "https://cdn-new.topcv.vn/unsafe/150x/https://static.topcv.vn/company_logos/Q5vc3HxXx3dmIE7sENmAg1y6Nourj8yb_1647318941____03598960d0a2461cffb745d79695bc0e.png",
        "url": "https://www.topcv.vn/viec-lam/nhan-vien-xu-ly-du-lieu-du-lieu-ve-hieu-suat-hoat-dong-chi-tieu-khong-phai-vi-tri-data-analyst/1381941.html?ta_source=JobSearchList_LinkDetail&u_sr_id=yoX7aR81f8Ckxo0uzm7NDGxijVGR55DeNTkfrdSK_1720322129",
        "location": "Hà Nội",
        "salary": "7 - 10 triệu",
        "status": "Cập nhật 1 tuần trước",
        "descriptions": [
            "• Tiến hành xuất số liệu từ phần mềm nội bộ và tổng hợp các số liệu về doanh số, số lượng khách hàng, đơn hàng,... (thực hiện định kỳ và phát sinh theo yêu cầu của Quản lý)• Tính toán, theo dõi tiến độ đạt KPI và các hiệu suất kinh doanh khác theo số liệu có sẵn từ phần mềm nội bộ• Báo cáo và update cho Quản lý, các Bộ phận liên quan (được chỉ định) các số liệu kinh doanh (như nêu trên)• Thực hiện các công việc khác linh hoạt theo sự phân công và hướng dẫn của Quản lý"
        ],
        "requirements": [
            "• Giới tính: Nữ• Cẩn thận, tỷ mỉ, cầu toàn• Trung thực, nhanh nhẹn, có tinh thần trách nhiệm cao, tôn trọng đạo đức nghề nghiệp và đảm bảo nguyên tắc bảo mật thông tin.• Sử dụng tốt tin học văn phòng (Xử lý dữ liệu bằng Microsoft)"
        ]
    },
    {
        "title": "Chuyên Viên Kinh Doanh B2B",
        "company": "Công ty TNHH Giải pháp và Phân tích dữ liệu Insight Data",
        "logo": "https://cdn-new.topcv.vn/unsafe/150x/https://static.topcv.vn/company_logos/6P1a5splhfXcAplHGCuR5dVVfIn2Oko8_1657610825____c6d9725926f42efb67c01079b8f09a6d.png",
        "url": "https://www.topcv.vn/viec-lam/chuyen-vien-kinh-doanh-b2b/1299040.html?ta_source=JobSearchList_LinkDetail&u_sr_id=yoX7aR81f8Ckxo0uzm7NDGxijVGR55DeNTkfrdSK_1720322129",
        "location": "Hà Nội",
        "salary": "6 - 10 triệu",
        "status": "Cập nhật 6 ngày trước",
        "descriptions": [
            "Tư vấn các dịch vụ và giải pháp của công ty",
            "Phối hợp với các bộ phận khác (MKT, giám đốc ...) để thúc đẩy kinh doanh.",
            "Theo dõi và đảm bảo tiến độ cung cấp dịch vụ cho đối tác/khách hàng cùng các phòng ban chức năng theo đúng quy trình.",
            "Theo dõi và lập báo cáo kinh doanh định kỳ (tuần, tháng, quý, năm). Đề xuất các phương án kinh doanh cho từng dự án và khách hàng",
            "Được làm việc với các khách hàng lớn (đa số là bank: Vpbank, Techcombank, Seabank, Sacombank, MB Bannk, OCB Bank...), đối tác, hãng ( thường là hãng lớn như Oracle, Microsoft, AWS, Google, DataBricks,...), các chuyên gia trên toàn thế giới."
        ],
        "requirements": [
            "Ứng viên theo học các ngành kinh tế, thương mại, quản trị kinh doanh, marketing hoặc CNTT.....",
            "Có ít nhất 6 tháng kinh nghiệm tại vị trí",
            "Giới tính: Nữ, ngoại hình ưa nhìn",
            "Ưu tiên ứng viên có kinh nghiệm liên quan CNTT"
        ]
    },
    {
        "title": "Chuyên Viên Phân Tích Dữ Liệu",
        "company": "Công ty Cổ phần Nụ Cười Mới Việt Nam",
        "logo": "https://cdn-new.topcv.vn/unsafe/150x/https://static.topcv.vn/company_logos/cong-ty-co-phan-nu-cuoi-moi-viet-nam-5f424b636cbe3.jpg",
        "url": "https://www.topcv.vn/viec-lam/chuyen-vien-phan-tich-du-lieu/1310930.html?ta_source=JobSearchList_LinkDetail&u_sr_id=yoX7aR81f8Ckxo0uzm7NDGxijVGR55DeNTkfrdSK_1720322129",
        "location": "Hà Nội",
        "salary": "13 - 15 triệu",
        "status": "Cập nhật 2 ngày trước",
        "descriptions": [
            "Quản trị dữ liệu:",
            "Thúc đẩy Kinh doanh:",
            "Tham gia phụ trách hệ thống dữ liệu của Công ty.",
            "Lưu trữ và xử lý dữ liệu, thực hiện phân quyền truy cập vào hệ thống,",
            "Tổng hợp báo cáo liên quan đến tình hình triển khai các kế hoạch kinh doanh.",
            "Quản trị hồ sơ: Lưu trữ và tổng hợp thông tin kế hoạch kinh doanh",
            "Báo cáo kịp thời, chính xác, đầy đủ thông tin liên quan đến công việc cho Quản lý trực tiếp theo định kỳ hoặc đột xuất.",
            "Thực hiện công việc thúc đẩy/ hỗ trợ kinh doanh cho tệp Khách hàng.",
            "Xây dựng quy định/ chính sách KPIs/ hiệu quả công việc của nhân sự kinh doanh (Phòng Telesale, Phòng Quan hệ đối tác, Bộ phận Tư vấn...)",
            "Truyền thông bộ chỉ tiêu KPIs đến toàn thể nhân sự kinh doanh Công ty.",
            "Xây dựng kế hoạch kinh doanh, chi phí cho hoạt động kinh doanh.",
            "Xây dựng và triển khai các chương trình bán hàng nhằm thúc đẩy và hỗ trợ kinh doanh.",
            "Tổ chức hướng dẫn, huấn luyện nhằm nâng cao năng lực tư vấn cho lực lượng chăm sóc."
        ],
        "requirements": [
            "Tốt nghiệp Đại học chuyên ngành Marketing, Công nghệ thông tin ... hoặc các ngành liên quan;",
            "Ưu tiên Có ít nhất 01 năm kinh nghiệm trong lĩnh vực liên quan;",
            "Thành thạo các phần mềm chuyên ngành và kỹ năng sử dụng tin học văn phòng tốt;",
            "Chịu được áp lực công việc cường độ cao,khả năng làm việc độc lập và làm việc nhóm;",
            "Có khả năng tổng hợp, phân tích, xử lý dữ liệu;",
            "Làm việc độc lập và làm việc theo nhóm;",
            "Trình bày lưu loát, truyền đạt hiệu quả, khả năng thuyết phục người khác."
        ]
    },
    {
        "title": "Nhân Viên Phân Tích Dữ Liệu BA",
        "company": "Công ty cổ phần đầu tư phát triển Máy Việt Nam - Chi Nhánh Hà Nội",
        "logo": "https://cdn-new.topcv.vn/unsafe/150x/https://static.topcv.vn/company_logos/cong-ty-co-phan-dau-tu-phat-trien-may-viet-nam-chi-nhanh-ha-noi-5c8f5bf17c55f_rs.jpg",
        "url": "https://www.topcv.vn/viec-lam/nhan-vien-phan-tich-du-lieu-ba/1269410.html?ta_source=JobSearchList_LinkDetail&u_sr_id=yoX7aR81f8Ckxo0uzm7NDGxijVGR55DeNTkfrdSK_1720322129",
        "location": "Hà Nội",
        "salary": "10 - 13 triệu",
        "status": "Cập nhật 2 ngày trước",
        "descriptions": [
            "Làm việc trực tiếp với khách hàng để thu thập và làm rõ các yêu cầu từ khách hàng.",
            "- Thực hiện phân tích và xây dựng tài liệu đặc tả yêu cầu nghiệp vụ, tài liệu thiết kế các trường hợp sử dụng (usecase), giao diện mẫu (prototype, wireframe) và các quy trình nghiệp vụ (workflow) cho đội phát triển phần mềm.",
            "- Phân tích các rủi ro liên quan đến các sản phẩm phần mềm, cơ sở dữ liệu và đề xuất các giải pháp khắc phục (nếu có); đóng góp các ý kiến, sáng kiến cải tiến sản phẩm phần mềm, giải pháp công nghệ.",
            "- Truyền đạt nội dung, hỗ trợ các thành viên dự án để làm rõ yêu cầu của khách hàng cần đáp ứng.",
            "- Tương tác chặt chẽ với các bên liên quan và khách hàng khác để đảm bảo phối hợp và thực hiện đúng đắn các dự án phát triển sản phẩm phần mềm.",
            "- Chủ động làm việc cùng đội ngũ phát triển và kiểm tra chất lượng sản phẩm phần mềm.",
            "- Hỗ trợ quản lý dự án trong việc lên kế hoạch và triển khai dự án.",
            "- Hỗ trợ đội ngũ kiểm tra chất lượng sản phẩm phần mềm xây dựng kịch bản kiểm chứng đảm bảo testcase đầy đủ và đáp ứng đúng đặc tả nghiệp vụ.",
            "- Thực hiện kiểm duyệt chất lượng sản phẩm đảm bảo đáp ứng đúng yêu cầu nghiệp vụ.",
            "- Tổ chức triển khai UAT, theo dõi và báo cáo kết quả cho quản lý dự án.",
            "- Soạn thảo tài liệu hướng dẫn sử dụng, tổ chức hướng dẫn, hỗ trợ cho người dùng sử dụng sản phẩm và hỗ trợ xử lý sự cố khi có vấn đề xảy ra.",
            "- Nghiên cứu, phân tích, so sánh và đề xuất giải pháp công nghệ phù hợp để áp dụng, triển khai các dự án phần mềm đáp ứng nhu cầu hiện tại và tương lai."
        ],
        "requirements": [
            "- Tốt nghiệp Cao đẳng, Đại học chuyên ngành CNTT hoặc có Chứng chỉ đào tạo về BA",
            "- Có Kinh nghiệm làm về ERP, CRM",
            "- Có khả năng xây dựng và thiết kế tài liệu đặc tả yêu cầu nghiệp vụ, xây dựng kịch bản kiểm thử (UAT).",
            "- Sử dụng tốt các công cụ hỗ trợ phân tích thiết kế.",
            "- Có kiến thức tốt về CNTT và hiểu được thiết kế kỹ thuật.",
            "- Có kỹ năng về UI/UX Designer là 1 lợi thế."
        ]
    },
    {
        "title": "Nhân Viên Phân Tích Dữ Liệu - Data Analyst (App)",
        "company": "Công Ty Cổ Phần Công Nghệ Android Việt Nam",
        "logo": "https://cdn-new.topcv.vn/unsafe/150x/https://static.topcv.vn/company_logos/cong-ty-co-phan-cong-nghe-android-viet-nam-5e74a2070e74b.jpg",
        "url": "https://www.topcv.vn/viec-lam/nhan-vien-phan-tich-du-lieu-data-analyst-app/1146727.html?ta_source=JobSearchList_LinkDetail&u_sr_id=yoX7aR81f8Ckxo0uzm7NDGxijVGR55DeNTkfrdSK_1720322129",
        "location": "Hà Nội",
        "salary": "Tới 20 triệu",
        "status": "Cập nhật 6 ngày trước",
        "descriptions": [
            "Tổng hợp dữ liệu người dùng từ các nguồn Google Analytic/Firebase và Adjust",
            "Theo dõi, phân tích, đánh giá các chỉ số để đưa ra các phương án đề xuất cho Product Team, Marketing Team",
            "Phân tích dữ liệu các sản phẩm của công ty (key metrics)",
            "Tạo mô hình dự đoán LTV các sản phẩm của công ty;",
            "Đánh giá mức độ hiệu quả của các chiến dịch UA marketing cho app iOS/Android;",
            "Thu thập dữ liệu, trực quan hóa dữ liệu để xây dựng các báo cáo phân tích;",
            "Tiến hành các thử nghiệm A/B test và phân tích kết quả của chúng;",
            "Nghiên cứu, đưa ra những ý tưởng phân tích dữ liệu để hiểu sâu và có các góc nhìn mới hơn từ các dữ liệu."
        ],
        "requirements": [
            "Tốt nghiệp đại học chuyên ngành toán, kinh tế, khoa học máy tính, quản lý thông tin, thống kê...",
            "Đã có kinh nghiệm (tối thiểu 6 tháng) tại vị trí tương đương hoặc có hiểu biết về ngành công nghiệp App Mobile;",
            "Có kinh nghiệm làm việc với Google Analytic/ Firebase cũng như các nguồn tracking khác liên quan.",
            "Có hiểu biết về marketing và các chỉ số app (LTV,ROI,ROAS,ARPU,ARPPU,...);",
            "Có kinh nghiệm và kỹ năng làm việc với Excel, kỹ năng trực quan hóa các dữ liệu thành dạng biểu đồ.",
            "Có kiến thức về toán học, thống kê và các phương pháp A/B test sản phẩm",
            "Có kinh nghiệm làm việc với cơ sở dữ liệu database, thành thạo SQL, Python là 1 lợi thế (không bắt buộc);",
            "Có kinh nghiệm với các công cụ BI là 1 lợi thế (không bắt buộc);"
        ]
    },
    {
        "title": "Data Analyst Executive",
        "company": "Ninja Van",
        "logo": "https://cdn-new.topcv.vn/unsafe/150x/https://static.topcv.vn/company_logos/Ykd2b8UHfhTTSvxys14IVp7oFKIYcUMk_1655187960____60516e3b2ffd4aa1bca84800e81282d3.png",
        "url": "https://www.topcv.vn/viec-lam/data-analyst-executive/1199404.html?ta_source=JobSearchList_LinkDetail&u_sr_id=yoX7aR81f8Ckxo0uzm7NDGxijVGR55DeNTkfrdSK_1720322129",
        "location": "Hồ Chí Minh",
        "salary": "Thoả thuận",
        "status": "Cập nhật 1 tuần trước",
        "descriptions": [
            "Building databases, monitoring tables, analyzing operational indicators according to the requirements of the department",
            "Develop and analyze operational and project reports at the request of management levels",
            "Tracking the company's overall goals, allocating them into appropriate target packages for each level of operational management",
            "Provide and monitor solution packages for operations to ensure that the set operating targets are met",
            "Cooperate with departments, coordinate in building and improving operational processes to improve service quality",
            "Consulting, providing risk analysis, operational opportunities for all levels of management",
            "Monitoring, statistics, analysis of cost structures",
            "Cost management, assessment and warning of risks affecting cost structure, room budget",
            "Other tasks to support the management of superiors"
        ],
        "requirements": [
            "Experience/Skills Required:",
            "At least 06 months of experience in managing, building, analyzing operational data or directly managing operations",
            "Requires basic skills in coding, using software, data solutions (Power BI ...)",
            "Good communication skills.",
            "Knowledge of Microsoft Office, Google Drive tools",
            "Self-study sense, careful work and good presentation ability."
        ]
    },
    {
        "title": "Nhân Viên Data Analyst ( Tracking - Optimize)",
        "company": "EDUPIA",
        "logo": "https://cdn-new.topcv.vn/unsafe/150x/https://static.topcv.vn/company_logos/edupia-738d242f1fe18d4bbd6e7dc01d9b31c1-6594db35ebfd5.jpg",
        "url": "https://www.topcv.vn/brand/educa/tuyen-dung/nhan-vien-data-analyst-tracking-optimize-j1343621.html?ta_source=JobSearchList_LinkDetail&u_sr_id=yoX7aR81f8Ckxo0uzm7NDGxijVGR55DeNTkfrdSK_1720322129",
        "location": "Hà Nội",
        "salary": "10 - 15 triệu",
        "status": "Cập nhật 1 tuần trước",
        "descriptions": [
            [
                "Mô tả công việc",
                "- Tổng hợp, xây dựng cơ sở dữ liệu, báo cáo đa chiều về các chỉ số Marketing - Sale- Đưa ra các cảnh báo về chỉ số đến các bộ phận liên quan- Theo dõi tiến độ thực thi các giải pháp cải tiến các chỉ số của bộ phận Marketing - Sale-  Các công việc khác theo sắp xếp, phân công quản lý trực tiếp."
            ]
        ],
        "requirements": [
            [
                "Yêu cầu ứng viên",
                "- Nam/Nữ  - độ tuổi từ 23- Có tư duy tổ chức dữ liệu tốt, khoa học- Thành thạo công cụ Excel, Google Sheet (Bắt buộc)- Có kinh nghiệm 6 tháng trong phân tích các chỉ số kinh doanh - Trẻ trung, năng động, chịu khó update xu hướng thị trường.- Có kỹ năng làm việc độc lập và làm việc theo nhóm.- Mong muốn được học hỏi, thăng tiến, có tinh thần cầu tiến, có mục tiêu rõ ràng."
            ]
        ]
    }
]